StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/core/rtw_mlme_ext.c
}

#if CONFIG_TXPWR_LIMIT
static void rtw_txpwr_init_regd_default(struct rf_ctl_t *rfctl)
{
	bool country_txpwr_lmt_override = 0;
	u8 txpwr_lmt[BAND_MAX];
	const char *name[BAND_MAX];
	u8 unknown_bmp = 0; /* unknown bitmap */
	char buf[TXPWR_NAMES_STR_LEN];
	u8 band;
	bool altenate_applied = 0;

	for (band = 0; band < BAND_MAX; band++) {
		txpwr_lmt[band] = TXPWR_LMT_NONE;
		name[band] = NULL;
		unknown_bmp |= BIT(band);
	}

	if (rfctl->txpwr_lmt_override != TXPWR_LMT_DEF) {
		country_txpwr_lmt_override = 1;
		for (band = 0; band < BAND_MAX; band++) {
			txpwr_lmt[band] = rfctl->txpwr_lmt_override;
		}
	} else {
		txpwr_lmt[BAND_ON_2_4G] = rtw_regd_to_txpwr_lmt(rtw_chplan_get_default_regd_2g(rfctl->ChannelPlan));
#if CONFIG_IEEE80211_BAND_5GHZ
		txpwr_lmt[BAND_ON_5G] = rtw_regd_to_txpwr_lmt(rtw_chplan_get_default_regd_5g(rfctl->ChannelPlan));
#endif
#if CONFIG_IEEE80211_BAND_6GHZ
		txpwr_lmt[BAND_ON_6G] = rtw_regd_to_txpwr_lmt(rtw_chplan_get_default_regd_6g(rfctl->chplan_6g));
#endif
	}

	for (band = 0; band < BAND_MAX; band++) {
		name[band] = txpwr_lmt_str(txpwr_lmt[band]);
		if (txpwr_lmt[band] == TXPWR_LMT_NONE || txpwr_lmt[band] == TXPWR_LMT_WW || txpwr_lmt[band] == TXPWR_LMT_NUM
		    || _rtw_txpwr_lmt_get_by_name(rfctl, name[band])) {
			unknown_bmp &= ~BIT(band);
		}
	}

	if (country_txpwr_lmt_override) {
		RTW_PRINT("default mapping country:%c%c to txpwr_lmt:%s\n"
			  , rfctl->alpha2[0], rfctl->alpha2[1]
			  , rtw_get_txpwr_lmt_names_str(buf, name, unknown_bmp)
			 );
	} else {
		RTW_PRINT("default mapping domain to txpwr_lmt:%s\n"
			  , rtw_get_txpwr_lmt_names_str(buf, name, unknown_bmp));
	}
	if (unknown_bmp == 0) {
		goto exit;
	}

	for (band = 0; band < BAND_MAX; band++) {
		if (!(unknown_bmp & BIT(band))) {
			continue;
		}
		if (TXPWR_LMT_ALTERNATE_DEFINED(txpwr_lmt[band])) {
			/*
			* To support older chips without new predefined txpwr_lmt:
			* - use txpwr_lmt_alternate() to get alternate if the selection is  not found
			*/
			altenate_applied = 1;
			txpwr_lmt[band] = txpwr_lmt_alternate(txpwr_lmt[band]);
			name[band] = txpwr_lmt_str(txpwr_lmt[band]);
			if (_rtw_txpwr_lmt_get_by_name(rfctl, name[band])) {
				unknown_bmp &= ~BIT(band);
			}
		}
	}
	if (altenate_applied) {
		RTW_PRINT("alternate applied txpwr_lmt:%s\n"
			  , rtw_get_txpwr_lmt_names_str(buf, name, unknown_bmp));
		if (unknown_bmp == 0) {
			goto exit;
		}
	}

	for (band = 0; band < BAND_MAX; band++) {
		if (!(unknown_bmp & BIT(band))) {
			continue;
		}
		txpwr_lmt[band] = TXPWR_LMT_WW;
		name[band] = txpwr_lmt_str(txpwr_lmt[band]);
		unknown_bmp &= ~BIT(band);
	}
	RTW_PRINT("world wide applied txpwr_lmt:%s\n"
		  , rtw_get_txpwr_lmt_names_str(buf, name, unknown_bmp));

exit:
	for (band = 0; band < BAND_MAX; band++) {
		rfctl->txpwr_lmt_name[band] = name[band];
	}
}

void rtw_txpwr_init_regd(struct rf_ctl_t *rfctl)
{
	const char *name = NULL;
	u8 band;
	struct regd_exc_ent *exc;
	struct txpwr_lmt_ent *ent;
	_irqL irqL;

	_enter_critical_mutex(&rfctl->txpwr_lmt_mutex, &irqL);

	for (band = 0; band < BAND_MAX; band++) {
		rfctl->txpwr_lmt_name[band] = NULL;
	}

	if (rfctl->txpwr_lmt_num == 0) {
		RTW_PRINT("there is no any txpwr_regd\n");
		goto release_lock;
	}

	/* search from exception mapping */
	exc = _rtw_regd_exc_search(rfctl, rfctl->alpha2, rfctl->ChannelPlan);
	if (exc) {
		u8 has_country = (exc->country[0] == '\0' && exc->country[1] == '\0') ? 0 : 1;

		if (strcmp(exc->lmt_name, txpwr_lmt_str(TXPWR_LMT_NONE)) == 0) {
			name = txpwr_lmt_str(TXPWR_LMT_NONE);
		} else if (strcmp(exc->lmt_name, txpwr_lmt_str(TXPWR_LMT_WW)) == 0) {
			name = txpwr_lmt_str(TXPWR_LMT_WW);
		} else {
			ent = _rtw_txpwr_lmt_get_by_name(rfctl, exc->lmt_name);
			if (ent) {
				name = ent->name;
			}
		}

		RTW_PRINT("exception mapping country:%c%c domain:0x%02x to%s txpwr_lmt:%s\n"
			  , has_country ? exc->country[0] : '-'
			  , has_country ? exc->country[1] : '-'
			  , exc->domain
			  , name ? "" : " unknown"
			  , exc->lmt_name
			 );
		if (name) {
			for (band = 0; band < BAND_MAX; band++) {
				rfctl->txpwr_lmt_name[band] = name;
			}
			goto release_lock;
		}
	}

#ifdef CONFIG_REGD_SRC_FROM_OS
	if (rfctl->regd_src == REGD_SRC_OS) {
		if (RFCTL_REG_WORLDWIDE(rfctl)) {
			name = txpwr_lmt_str(TXPWR_LMT_WW);
		} else {
			char alpha2[3] = {
				rfctl->alpha2[0], rfctl->alpha2[1], 0
			};

			ent = _rtw_txpwr_lmt_get_by_name(rfctl, alpha2);
			if (ent) {
				name = ent->name;
			}
		}

		if (name) {
			for (band = 0; band < BAND_MAX; band++) {
				rfctl->txpwr_lmt_name[band] = name;
			}
			RTW_PRINT("mapping country:%c%c to txpwr_lmt:%s\n"
				  , rfctl->alpha2[0]
				  , rfctl->alpha2[1]
				  , name
				 );
			goto release_lock;
		}

		if (rfctl->ChannelPlan == RTW_CHPLAN_UNSPECIFIED) {
			name = txpwr_lmt_str(TXPWR_LMT_WW);
			for (band = 0; band < BAND_MAX; band++) {
				rfctl->txpwr_lmt_name[band] = name;
			}
			RTW_PRINT("mapping unsupported country:%c%c to txpwr_lmt:%s\n"
				  , rfctl->alpha2[0]
				  , rfctl->alpha2[1]
				  , name
				 );
			goto release_lock;
		}
	}
#endif

	/* follow default channel plan mapping */
	rtw_txpwr_init_regd_default(rfctl);

release_lock:
	_exit_critical_mutex(&rfctl->txpwr_lmt_mutex, &irqL);
}

bool rtw_rfctl_is_current_txpwr_lmt(struct rf_ctl_t *rfctl, const char *name)
{
	int band;

	for (band = 0; band < BAND_MAX; band++)
		if (rfctl->txpwr_lmt_name[band] && strcmp(name, rfctl->txpwr_lmt_name[band]) == 0) {
			return 1;
		}

	return 0;
}
#endif /* CONFIG_TXPWR_LIMIT */

int rtw_rfctl_init(_adapter *adapter)
{
	struct registry_priv *regsty = adapter_to_regsty(adapter);
	struct rf_ctl_t *rfctl = adapter_to_rfctl(adapter);
	int ret;

	_rtw_mutex_init(&rfctl->offch_mutex);

	rfctl->user_ChannelPlan = RTW_CHPLAN_UNSPECIFIED;
#if CONFIG_IEEE80211_BAND_6GHZ
	rfctl->user_chplan_6g = RTW_CHPLAN_6G_UNSPECIFIED;
#endif

#ifdef CONFIG_80211D
	rfctl->country_ie_slave_en_role = regsty->country_ie_slave_en_role;
	rfctl->country_ie_slave_en_ifbmp = regsty->country_ie_slave_en_ifbmp;
	rfctl->effected_cisr_id = CONFIG_IFACE_NUMBER;
#endif

#if CONFIG_TXPWR_LIMIT
	_rtw_mutex_init(&rfctl->txpwr_lmt_mutex);
	_rtw_init_listhead(&rfctl->reg_exc_list);
	_rtw_init_listhead(&rfctl->txpwr_lmt_list);
#endif

	rfctl->ch_sel_within_same_band = 1;

#ifdef CONFIG_DFS_MASTER
	rfctl->dfs_region_domain = regsty->dfs_region_domain;
	rfctl->cac_start_time = rfctl->cac_end_time = RTW_CAC_STOPPED;
	rtw_init_timer(&(rfctl->radar_detect_timer), adapter, rtw_dfs_rd_timer_hdl, rfctl);
#endif
#if CONFIG_DFS_SLAVE_WITH_RADAR_DETECT
	rfctl->dfs_slave_with_rd = 1;
#endif

	if (regsty->antenna_gain != UNSPECIFIED_MBM) {
		rfctl->antenna_gain = regsty->antenna_gain;
	}

#if defined(CONFIG_CONCURRENT_MODE) && defined(CONFIG_AP_MODE)
	rfctl->ap_csa_cnt_input = DEFAULT_CSA_CNT;
#endif

	ret = op_class_pref_init(adapter);
	if (ret != _SUCCESS) {
		op_class_pref_deinit(adapter);
	}

	return ret;
}

void rtw_rfctl_deinit(_adapter *adapter)
{
	struct rf_ctl_t *rfctl = adapter_to_rfctl(adapter);

	_rtw_mutex_free(&rfctl->offch_mutex);

#if CONFIG_TXPWR_LIMIT
	rtw_regd_exc_list_free(rfctl);
	rtw_txpwr_lmt_list_free(rfctl);
	_rtw_mutex_free(&rfctl->txpwr_lmt_mutex);
#endif

	op_class_pref_deinit(adapter);
}

