StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/core/rtw_mlme_ext.c
	if (rfctl->offch_state == OFFCHS_NONE) {
		/* prepare to leave operating channel */
		rfctl->offch_state = OFFCHS_LEAVING_OP;

		/* clear HW TX queue */
		rtw_hal_set_hwreg(adapter, HW_VAR_CHECK_TXBUF, 0);

		rtw_hal_macid_sleep_all_used(adapter);

		rtw_ps_annc(adapter, 1);

		rfctl->offch_state = OFFCHS_LEAVE_OP;
	}

	_exit_critical_mutex(&rfctl->offch_mutex, NULL);
}

void rtw_back_opch(_adapter *adapter)
{
	struct rf_ctl_t *rfctl = adapter_to_rfctl(adapter);

#ifdef CONFIG_MCC_MODE
	if (MCC_EN(adapter) && rtw_hal_check_mcc_status(adapter, MCC_STATUS_DOING_MCC)) {
		return;
	}
#endif

	_enter_critical_mutex(&rfctl->offch_mutex, NULL);

	if (rfctl->offch_state != OFFCHS_NONE) {
		rfctl->offch_state = OFFCHS_BACKING_OP;
		rtw_hal_macid_wakeup_all_used(adapter);
		rtw_ps_annc(adapter, 0);

		rfctl->offch_state = OFFCHS_NONE;
		rtw_mi_os_xmit_schedule(adapter);
	}

	_exit_critical_mutex(&rfctl->offch_mutex, NULL);
}

void sitesurvey_set_igi(_adapter *adapter)
{
	struct mlme_ext_priv *mlmeext = &adapter->mlmeextpriv;
	struct ss_res *ss = &mlmeext->sitesurvey_res;
	u8 igi;
#ifdef CONFIG_P2P
	struct wifidirect_info *pwdinfo = &adapter->wdinfo;
#endif

	switch (mlmeext_scan_state(mlmeext)) {
	case SCAN_ENTER:
#ifdef CONFIG_P2P
#ifdef CONFIG_IOCTL_CFG80211
		if (pwdinfo->driver_interface == DRIVER_CFG80211 && rtw_cfg80211_is_p2p_scan(adapter)) {
			igi = 0x30;
		} else
#endif /* CONFIG_IOCTL_CFG80211 */
			if (!rtw_p2p_chk_state(pwdinfo, P2P_STATE_NONE)) {
				igi = 0x28;
			} else
#endif /* CONFIG_P2P */

				if (ss->igi) {
					igi = ss->igi;
				} else
#if defined(CONFIG_RTW_ACS) && defined(CONFIG_RTW_ACS_DBG)
					if (IS_ACS_ENABLE(adapter) && rtw_is_acs_igi_valid(adapter)) {
						igi = rtw_acs_get_adv_igi(adapter);
					} else
#endif /*CONFIG_RTW_ACS*/
						igi = 0x1e;

		/* record IGI status */
		ss->igi_scan = igi;
		rtw_hal_get_odm_var(adapter, HAL_ODM_INITIAL_GAIN, &ss->igi_before_scan, NULL);

		/* disable DIG and set IGI for scan */
		rtw_hal_set_odm_var(adapter, HAL_ODM_INITIAL_GAIN, &igi, _FALSE);
		break;
	case SCAN_COMPLETE:
	case SCAN_TO_P2P_LISTEN:
		/* enable DIG and restore IGI */
		igi = 0xff;
		rtw_hal_set_odm_var(adapter, HAL_ODM_INITIAL_GAIN, &igi, _FALSE);
		break;
#ifdef CONFIG_SCAN_BACKOP
	case SCAN_BACKING_OP:
		/* write IGI for op channel when DIG is not enabled */
		odm_write_dig(adapter_to_phydm(adapter), ss->igi_before_scan);
		break;
	case SCAN_LEAVE_OP:
		/* write IGI for scan when DIG is not enabled */
		odm_write_dig(adapter_to_phydm(adapter), ss->igi_scan);
		break;
#endif /* CONFIG_SCAN_BACKOP */
	default:
		rtw_warn_on(1);
		break;
	}
}
void sitesurvey_set_msr(_adapter *adapter, bool enter)
{
	u8 network_type;
	struct mlme_ext_priv *pmlmeext = &adapter->mlmeextpriv;
	struct mlme_ext_info *pmlmeinfo = &(pmlmeext->mlmext_info);

	if (enter) {
#ifdef CONFIG_MI_WITH_MBSSID_CAM
		rtw_hal_get_hwreg(adapter, HW_VAR_MEDIA_STATUS, (u8 *)(&pmlmeinfo->hw_media_state));
#endif
		/* set MSR to no link state */
		network_type = _HW_STATE_NOLINK_;
	} else {
#ifdef CONFIG_MI_WITH_MBSSID_CAM
		network_type = pmlmeinfo->hw_media_state;
#else
		network_type = pmlmeinfo->state & 0x3;
#endif
	}
	Set_MSR(adapter, network_type);
}

void sitesurvey_set_offch_state(_adapter *adapter, u8 scan_state)
{
	struct rf_ctl_t *rfctl = adapter_to_rfctl(adapter);

	_enter_critical_mutex(&rfctl->offch_mutex, NULL);

	switch (scan_state) {
	case SCAN_DISABLE:
	case SCAN_BACK_OP:
		rfctl->offch_state = OFFCHS_NONE;
		break;
	case SCAN_START:
	case SCAN_LEAVING_OP:
		rfctl->offch_state = OFFCHS_LEAVING_OP;
		break;
	case SCAN_ENTER:
	case SCAN_LEAVE_OP:
		rfctl->offch_state = OFFCHS_LEAVE_OP;
		break;
	case SCAN_COMPLETE:
	case SCAN_BACKING_OP:
		rfctl->offch_state = OFFCHS_BACKING_OP;
		break;
	default:
		break;
	}

	_exit_critical_mutex(&rfctl->offch_mutex, NULL);
}

#ifdef CONFIG_RTW_ROAM_QUICKSCAN
extern inline int is_same_ess(WLAN_BSSID_EX *a, WLAN_BSSID_EX *b);
extern int rtw_is_desired_network(_adapter *adapter, struct wlan_network *pnetwork);
void generate_quickss(_adapter *padapter)
{
	struct mlme_priv        *pmlmepriv = &(padapter->mlmepriv);
	struct wlan_network     *pnetwork = NULL;
	struct mlme_ext_priv *pmlmeext = &padapter->mlmeextpriv;
	struct rtw_ieee80211_channel *roam_ch = pmlmeext->roam_ch;
	struct rf_ctl_t *rfctl = adapter_to_rfctl(padapter);
	int chan;
	_irqL irqL;
	_list *plist, *phead;
	u8 *target_ssid = NULL, *ssid = NULL, ds_cfg, j, ch_num;
	u32  target_ssid_len = 0, ssid_len = 0;
	u8 mark[166];

	target_ssid = pmlmepriv->cur_network.network.Ssid.Ssid;
	target_ssid_len = pmlmepriv->cur_network.network.Ssid.SsidLength;
	_rtw_memset(mark, 0, sizeof(u8) * 166);

	_enter_critical_bh(&(pmlmepriv->scanned_queue.lock), &irqL);
	phead = get_list_head(&(pmlmepriv->scanned_queue));
	if (!phead) {
		_exit_critical_bh(&(pmlmepriv->scanned_queue.lock), &irqL);
		return;
	}
	plist = get_next(phead);
	if (!plist) {
		_exit_critical_bh(&(pmlmepriv->scanned_queue.lock), &irqL);
		return;
	}
	while (1) {
		if (rtw_end_of_queue_search(phead, plist) == _TRUE) {
			break;
		}

		pnetwork = LIST_CONTAINOR(plist, struct wlan_network, list);
		if (!pnetwork) {
			break;
		}

		ds_cfg = pnetwork->network.Configuration.DSConfig;
		if (is_same_ess(&pnetwork->network, &pmlmepriv->cur_network.network) &&
		    rtw_is_desired_network(padapter, pnetwork)) {
			mark[ds_cfg] = 1;
		}

		plist = get_next(plist);
	}
	/* ex: assume roaming channel=1/6/40/165, then mark[1]/[6]/[40]/[165] are 1.  */
	_exit_critical_bh(&(pmlmepriv->scanned_queue.lock), &irqL);

	ch_num = 0;
	for (j = 0; j < rfctl->max_chan_nums; j++) {
		chan = rfctl->channel_set[j].ChannelNum;
		if (mark[chan]) {
			roam_ch[ch_num].hw_value = chan;
			roam_ch[ch_num++].flags = rfctl->channel_set[j].flags;
		}
	}
	pmlmeext->roam_ch_num = ch_num;
}
#endif

u8 sitesurvey_cmd_hdl(_adapter *padapter, u8 *pbuf)
{
	struct sitesurvey_parm	*pparm = (struct sitesurvey_parm *)pbuf;
#ifdef DBG_CHECK_FW_PS_STATE
	struct dvobj_priv *dvobj = padapter->dvobj;
	struct debug_priv *pdbgpriv = &dvobj->drv_dbg;
#endif
	struct mlme_ext_priv *pmlmeext = &padapter->mlmeextpriv;
	struct ss_res *ss = &pmlmeext->sitesurvey_res;
#if defined(CONFIG_RTW_CFGVENDOR_RANDOM_MAC_OUI) || defined(CONFIG_RTW_SCAN_RAND)
	struct rtw_wdev_priv *pwdev_priv = adapter_wdev_data(padapter);
#endif
	u8 val8;

#ifdef CONFIG_P2P
	struct wifidirect_info *pwdinfo = &padapter->wdinfo;
#ifdef CONFIG_CONCURRENT_MODE
	struct roch_info *prochinfo = &padapter->rochinfo;
#endif
#endif

