StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/core/rtw_mlme_ext.c
		if (MSTATE_STA_LD_NUM(&mstate) + MSTATE_AP_LD_NUM(&mstate) + MSTATE_MESH_LD_NUM(&mstate) >= 4) {
			connect_allow = _FALSE;
		}

		RTW_INFO(FUNC_ADPT_FMT" connect_allow:%d\n"
			 , FUNC_ADPT_ARG(adapter), connect_allow);

		if (connect_allow == _FALSE) {
			goto exit;
		}

connect_allow_hdl:
		/* connect_allow == _TRUE */

		if (chbw_allow == _FALSE) {
			u_ch = cur_ch;
			u_bw = cur_bw;
			u_offset = cur_ch_offset;

			for (i = 0; i < dvobj->iface_nums; i++) {
				iface = dvobj->padapters[i];
				mlme = &iface->mlmepriv;
				mlmeext = &iface->mlmeextpriv;

				if (!iface || iface == adapter) {
					continue;
				}

#ifdef CONFIG_AP_MODE
				if ((MLME_IS_AP(iface) || MLME_IS_MESH(iface))
				    && check_fwstate(mlme, WIFI_ASOC_STATE)
				   ) {
#ifdef CONFIG_SPCT_CH_SWITCH
					if (1) {
						rtw_ap_inform_ch_switch(iface, pmlmeext->cur_channel, pmlmeext->cur_ch_offset);
					} else
#endif
						if (rfctl->ap_csa_en == AP_CSA_DISABLE) {
							rtw_sta_flush(iface, _FALSE);
						}

					rtw_hal_set_hwreg(iface, HW_VAR_CHECK_TXBUF, 0);
					set_fwstate(mlme, WIFI_OP_CH_SWITCHING);
				} else
#endif /* CONFIG_AP_MODE */
					if (check_fwstate(mlme, WIFI_STATION_STATE)
					    && check_fwstate(mlme, WIFI_ASOC_STATE)
					   ) {
						rtw_disassoc_cmd(iface, 500, RTW_CMDF_DIRECTLY);
						rtw_indicate_disconnect(iface, 0, _FALSE);
						rtw_free_assoc_resources(iface, _TRUE);
					}
			}
		}
	}
#endif /* CONFIG_CONCURRENT_MODE */

#ifdef CONFIG_80211D
	rtw_joinbss_update_regulatory(adapter, &adapter->mlmeextpriv.mlmext_info.network);
#endif

#ifdef CONFIG_DFS_MASTER
	rtw_dfs_rd_en_decision(adapter, MLME_STA_CONNECTING, 0);
#endif

exit:

#if defined(CONFIG_CONCURRENT_MODE) && defined(CONFIG_AP_MODE)
	if (rfctl->ap_csa_en != AP_CSA_DISABLE) {
		u8 enable = 0;
		rfctl->ap_csa_en = AP_CSA_DISABLE;
		rtw_hal_set_hwreg(adapter, HW_VAR_BCN_EARLY_C2H_RPT, &enable);
	}
#endif

	if (connect_allow == _TRUE) {
		RTW_INFO(FUNC_ADPT_FMT" union: %u,%u,%u\n", FUNC_ADPT_ARG(adapter), u_ch, u_bw, u_offset);
		rtw_mi_update_union_chan_inf(adapter, u_ch, u_offset, u_bw);
		*ch = u_ch;
		*bw = u_bw;
		*offset = u_offset;

#if defined(CONFIG_IOCTL_CFG80211) && (LINUX_VERSION_CODE >= KERNEL_VERSION(3, 5, 0))
		{
			u8 ht_option = 0;

#ifdef CONFIG_80211N_HT
			ht_option = adapter->mlmepriv.htpriv.ht_option;
#endif /* CONFIG_80211N_HT */

			/*
				when supplicant send the mlme frame,
				the bss freq is updated by channel switch event.
			*/
			rtw_cfg80211_ch_switch_notify(adapter,
						      cur_ch, cur_bw, cur_ch_offset, ht_option, 1);
		}
#endif
	}

	return connect_allow == _TRUE ? _SUCCESS : _FAIL;
}

void rtw_set_external_auth_status(_adapter *padapter,
				  const void *data, int len)
{
#ifdef CONFIG_IOCTL_CFG80211
	struct net_device *dev = padapter->pnetdev;
	struct wiphy *wiphy = adapter_to_wiphy(padapter);
	struct rtw_external_auth_params params;

	/* convert data to external_auth_params */
	params.action = RTW_GET_BE32((u8 *)data);
	_rtw_memcpy(&params.bssid, (u8 *)data + 4, ETH_ALEN);
	_rtw_memcpy(&params.ssid.ssid, (u8 *)data + 10, WLAN_SSID_MAXLEN);
	params.ssid.ssid_len = RTW_GET_BE64((u8 *)data + 42);
	params.key_mgmt_suite = RTW_GET_BE32((u8 *)data + 58);
	params.status = RTW_GET_BE16((u8 *)data + 62);
	_rtw_memcpy(&params.pmkid, (u8 *)data + 64, PMKID_LEN);

	rtw_cfg80211_external_auth_status(wiphy, dev, &params);
#endif /* CONFIG_IOCTL_CFG80211 */
}

u8 rtw_iqk_hdl(_adapter *padapter, unsigned char *pbuf)
{
	rtw_hal_phydm_cal_trigger(padapter);
	return	H2C_SUCCESS;
}

u8 rtw_set_chbw_hdl(_adapter *padapter, u8 *pbuf)
{
	struct set_ch_parm *set_ch_parm;
	struct mlme_ext_priv	*pmlmeext = &padapter->mlmeextpriv;
	u8 ifbmp_s = rtw_mi_get_ld_sta_ifbmp(padapter);
	struct dvobj_priv *dvobj = adapter_to_dvobj(padapter);
	u8 u_ch, u_bw, u_offset;

	if (!pbuf) {
		return H2C_PARAMETERS_ERROR;
	}

	set_ch_parm = (struct set_ch_parm *)pbuf;

	RTW_INFO(FUNC_NDEV_FMT" ch:%u, bw:%u, ch_offset:%u\n",
		 FUNC_NDEV_ARG(padapter->pnetdev),
		 set_ch_parm->ch, set_ch_parm->bw, set_ch_parm->ch_offset);

	/*  update ch, bw, offset for all asoc STA ifaces */
	if (ifbmp_s) {
		_adapter *iface;
		int i;

		for (i = 0; i < dvobj->iface_nums; i++) {
			iface = dvobj->padapters[i];
			if (!iface || !(ifbmp_s & BIT(iface->iface_id))) {
				continue;
			}

			/* update STA mode ch/bw/offset */
			iface->mlmeextpriv.cur_channel = set_ch_parm->ch;
			iface->mlmeextpriv.cur_bwmode = set_ch_parm->bw;
			iface->mlmeextpriv.cur_ch_offset = set_ch_parm->ch_offset;
			/* updaet STA mode DSConfig , ap mode will update in rtw_change_bss_chbw_cmd */
			iface->mlmepriv.cur_network.network.Configuration.DSConfig = set_ch_parm->ch;
		}
	}

	LeaveAllPowerSaveModeDirect(padapter);

	set_channel_bwmode(padapter, set_ch_parm->ch, set_ch_parm->ch_offset, set_ch_parm->bw);

	rtw_mi_get_ch_setting_union(padapter, &u_ch, &u_bw, &u_offset);
	rtw_mi_update_union_chan_inf(padapter, u_ch, u_offset, u_bw);
	rtw_rfctl_update_op_mode(dvobj_to_rfctl(dvobj), 0, 0);

	return	H2C_SUCCESS;
}

static void get_str_of_set_chplan_keys(char *buf, u8 buf_len, struct SetChannelPlan_param *param)
{
	char *pos = buf;

#ifdef CONFIG_80211D
	if (param->has_cisr) {
		pos += snprintf(pos, buf_len - (pos - buf), "alpha2:"ALPHA2_FMT" %s"
				, ALPHA2_ARG(param->cisr.alpha2), cis_status_str(param->cisr.status));
	} else
#endif
		if (param->has_country) {
			pos += snprintf(pos, buf_len - (pos - buf), "alpha2:"ALPHA2_FMT, ALPHA2_ARG(param->country_ent.alpha2));
		} else {
			if (param->channel_plan == RTW_CHPLAN_UNSPECIFIED) {
				pos += snprintf(pos, buf_len - (pos - buf), "chplan:NA");
			} else {
				pos += snprintf(pos, buf_len - (pos - buf), "chplan:0x%02X", param->channel_plan);
			}

#if CONFIG_IEEE80211_BAND_6GHZ
			if (param->channel_plan_6g == RTW_CHPLAN_6G_UNSPECIFIED) {
				pos += snprintf(pos, buf_len - (pos - buf), " chplan_6g:NA");
			} else {
				pos += snprintf(pos, buf_len - (pos - buf), " chplan_6g:0x%02X", param->channel_plan_6g);
			}
#endif
		}
}

#ifdef CONFIG_80211D
static bool rtw_chplan_rtk_priv_req_prehdl_country_ie(_adapter *adapter, struct SetChannelPlan_param *param, const char *caller)
{
	struct rf_ctl_t *rfctl = adapter_to_rfctl(adapter);
	int i;
	bool effected = 1;

#ifdef CONFIG_RTW_DEBUG
	if (rtw_drv_log_level >= _DRV_DEBUG_) {
		RTW_PRINT("%s cisr before\n", caller);
		dump_country_ie_slave_records(RTW_DBGDUMP, rfctl, 0);
	}
#endif

	if (param->inr == RTW_REGD_SET_BY_USER
	    && rfctl->effected_cisr_id != CONFIG_IFACE_NUMBER
	   ) {
		/* country IE setting is applied, user setting is only recorded but not applied */
		effected = 0;
		goto exit;
	}

	if (param->inr == RTW_REGD_SET_BY_COUNTRY_IE) {
		struct country_ie_slave_record ori_cisr = rfctl->cisr[adapter->iface_id];
		struct country_ie_slave_record ori_ecisr;
		u8 ori_ecisr_id = rfctl->effected_cisr_id;
		u8 new_ecisr_id = CONFIG_IFACE_NUMBER;
		u8 status_score[] = { /* conservative policy */
			[COUNTRY_IE_SLAVE_UNKNOWN] = 3,
			[COUNTRY_IE_SLAVE_OPCH_NOEXIST] = 2,
			[COUNTRY_IE_SLAVE_APPLICABLE] = 1,
		};
		char buf[32];

		if (_rtw_memcmp(&rfctl->cisr[adapter->iface_id], &param->cisr, sizeof(param->cisr)) == _TRUE) {
			/* record no change  */
			effected = 0;
			goto exit;
		}

		if (ori_ecisr_id != CONFIG_IFACE_NUMBER) {
			_rtw_memcpy(&ori_ecisr, &rfctl->cisr[ori_ecisr_id], sizeof(ori_ecisr));
		}

		_rtw_memcpy(&rfctl->cisr[adapter->iface_id], &param->cisr, sizeof(param->cisr));
		if ((ori_cisr.status == COUNTRY_IE_SLAVE_NOCOUNTRY
		     && rfctl->cisr[adapter->iface_id].status == COUNTRY_IE_SLAVE_NOCOUNTRY)
		    || (ori_cisr.status == COUNTRY_IE_SLAVE_UNKNOWN
			&& rfctl->cisr[adapter->iface_id].status == COUNTRY_IE_SLAVE_UNKNOWN)
		   ) {
			/* will take no effect  */
			effected = 0;
			goto exit;
		}

		for (i = 0; i < CONFIG_IFACE_NUMBER; i++) {
			if (rfctl->cisr[i].status == COUNTRY_IE_SLAVE_NOCOUNTRY) {
				continue;
			}
			if (new_ecisr_id == CONFIG_IFACE_NUMBER
			    /* high score */
			    || status_score[rfctl->cisr[i].status] > status_score[rfctl->cisr[new_ecisr_id].status]
			    /* same score, prefer the same alpha2 as current effected(same score) one */
			    || (status_score[rfctl->cisr[i].status] == status_score[rfctl->cisr[new_ecisr_id].status]
				&& ori_ecisr_id != CONFIG_IFACE_NUMBER
				&& rfctl->cisr[ori_ecisr_id].status == rfctl->cisr[new_ecisr_id].status
				&& _rtw_memcmp(rfctl->cisr[ori_ecisr_id].alpha2, rfctl->cisr[new_ecisr_id].alpha2, 2) == _FALSE
				&& _rtw_memcmp(rfctl->cisr[ori_ecisr_id].alpha2, rfctl->cisr[i].alpha2, 2) == _TRUE)
			   ) {
				new_ecisr_id = i;
			}
		}

		rfctl->effected_cisr_id = new_ecisr_id;

