StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/core/rtw_mlme_ext.c
		if (rfctl->effected_cisr_id == CONFIG_IFACE_NUMBER) {
			/* no country IE setting */
			const char *alpha2;

			if (strncmp(rfctl->user_alpha2, "\x00\x00", 2) != 0) {
				/* restore to user setting */
				param->inr = RTW_REGD_SET_BY_USER;
				alpha2 = rfctl->user_alpha2;
				param->channel_plan = rfctl->user_ChannelPlan;
#if CONFIG_IEEE80211_BAND_6GHZ
				param->channel_plan_6g = rfctl->user_chplan_6g;
#endif
			} else {
				/* restore to init setting */
				param->inr = RTW_REGD_SET_BY_INIT;
				alpha2 = rfctl->init_alpha2;
				param->channel_plan = rfctl->init_ChannelPlan;
#if CONFIG_IEEE80211_BAND_6GHZ
				param->channel_plan_6g = rfctl->init_chplan_6g;
#endif
			}

			if (IS_ALPHA2_UNSPEC(alpha2) || IS_ALPHA2_WORLDWIDE(alpha2)) {
				param->has_country = 0;
			} else if (rtw_get_chplan_from_country(alpha2, &param->country_ent)) {
				param->channel_plan = param->country_ent.chplan;
#if CONFIG_IEEE80211_BAND_6GHZ
				param->channel_plan_6g = param->country_ent.chplan_6g;
#endif
				param->has_country = 1;
			} else {
				RTW_WARN("%s unexpected country_code:\"%c%c\", set to \"00\"\n", caller, alpha2[0], alpha2[1]);
				rtw_warn_on(1);
				rtw_get_chplan_worldwide(&param->country_ent);
				param->channel_plan = param->country_ent.chplan;
#if CONFIG_IEEE80211_BAND_6GHZ
				param->channel_plan_6g = param->country_ent.chplan_6g;
#endif
				param->has_country = 1;
			}
			param->has_cisr = 0;

			get_str_of_set_chplan_keys(buf, 32, param);
			RTW_INFO("%s restore inr:%s %s\n", caller, regd_inr_str(param->inr), buf);
		} else {
			/* has country IE setting */
			if (ori_ecisr_id != CONFIG_IFACE_NUMBER) {
				/* has country IE setting originally  */
				if (_rtw_memcmp(&ori_ecisr, &rfctl->cisr[new_ecisr_id], sizeof(ori_ecisr)) == _TRUE) {
					/* same record content, no effect */
					effected = 0;
					goto exit;
				}
			}
			rtw_get_chplan_from_cisrs(rfctl, &param->country_ent, caller);
			param->channel_plan = param->country_ent.chplan;
#if CONFIG_IEEE80211_BAND_6GHZ
			param->channel_plan_6g = param->country_ent.chplan_6g;
#endif
			param->has_country = 1;
			param->has_cisr = 0;

			get_str_of_set_chplan_keys(buf, 32, param);
			RTW_INFO("%s trigger inr:%s %s\n", caller, regd_inr_str(param->inr), buf);
		}
	}

exit:
#ifdef CONFIG_RTW_DEBUG
	if (rtw_drv_log_level >= _DRV_DEBUG_) {
		RTW_PRINT("%s cisr after\n", caller);
		dump_country_ie_slave_records(RTW_DBGDUMP, rfctl, 0);
	}
#endif

	return effected;
}
#endif /* CONFIG_80211D */

static bool rtw_chplan_rtk_priv_req_prehdl_domain_code(_adapter *adapter, struct SetChannelPlan_param *param, const char *caller)
{
	struct rf_ctl_t *rfctl = adapter_to_rfctl(adapter);

	/* disallow invalid input */
	if ((param->channel_plan != RTW_CHPLAN_UNSPECIFIED
	     && !rtw_is_channel_plan_valid(param->channel_plan))
	   ) {
		RTW_WARN("%s invalid chplan:0x%02X\n", caller, param->channel_plan);
		return _FAIL;
	}

#if CONFIG_IEEE80211_BAND_6GHZ
	if (param->channel_plan_6g != RTW_CHPLAN_6G_UNSPECIFIED
	    && !rtw_is_channel_plan_6g_valid(param->channel_plan_6g)
	   ) {
		RTW_WARN("%s invalid chplan_6g:0x%02X\n", caller, param->channel_plan_6g);
		return _FAIL;
	}
#endif

	/* use original value when unspecified */
	if (param->channel_plan == RTW_CHPLAN_UNSPECIFIED) {
		param->channel_plan = rfctl->ChannelPlan;
	}
#if CONFIG_IEEE80211_BAND_6GHZ
	if (param->channel_plan_6g == RTW_CHPLAN_6G_UNSPECIFIED) {
		param->channel_plan_6g = rfctl->chplan_6g;
	}
#endif

	return _SUCCESS;
}

static void rtw_chplan_rtk_priv_req_prehdl_country_ent(struct SetChannelPlan_param *param)
{
	if (!param->has_country) {
		u8 chplan_6g = RTW_CHPLAN_6G_NULL;

#if CONFIG_IEEE80211_BAND_6GHZ
		chplan_6g = param->channel_plan_6g;
#endif

		if (rtw_chplan_ids_is_world_wide(param->channel_plan, chplan_6g)) {
			rtw_get_chplan_worldwide(&param->country_ent);
		} else {
			SET_UNSPEC_ALPHA2(param->country_ent.alpha2);
			param->country_ent.edcca_mode_2g_override = RTW_EDCCA_DEF;
#if CONFIG_IEEE80211_BAND_5GHZ
			param->country_ent.edcca_mode_5g_override = RTW_EDCCA_DEF;
#endif
#if CONFIG_IEEE80211_BAND_6GHZ
			param->country_ent.edcca_mode_6g_override = RTW_EDCCA_DEF;
#endif
			param->country_ent.txpwr_lmt_override = TXPWR_LMT_DEF;
#if defined(CONFIG_80211AX_HE) || defined(CONFIG_80211AC_VHT)
			param->country_ent.proto_en = CHPLAN_PROTO_EN_ALL;
#endif
		}
		param->has_country = 1;
	}
}

u8 rtw_set_chplan_hdl(_adapter *padapter, unsigned char *pbuf)
{
	struct SetChannelPlan_param *param;
	struct rf_ctl_t *rfctl = adapter_to_rfctl(padapter);
	bool effected = 1;
	char buf[32];
	enum rtw_regd_inr ori_inr;
#ifdef CONFIG_IOCTL_CFG80211
	struct get_chplan_resp *chplan;
#endif

	if (!pbuf) {
		return H2C_PARAMETERS_ERROR;
	}

	param = (struct SetChannelPlan_param *)pbuf;
	ori_inr = param->inr;

	get_str_of_set_chplan_keys(buf, 32, param);
	RTW_INFO("%s iface_id:%u src:%s inr:%s %s\n", __func__, padapter->iface_id
		 , regd_src_str(param->regd_src), regd_inr_str(param->inr), buf);

	/* check input parameter */
	if (param->regd_src == REGD_SRC_RTK_PRIV) {
#ifdef CONFIG_80211D
		effected = rtw_chplan_rtk_priv_req_prehdl_country_ie(padapter, param, __func__);
#endif

		if (rtw_chplan_rtk_priv_req_prehdl_domain_code(padapter, param, __func__) != _SUCCESS) {
			return H2C_PARAMETERS_ERROR;
		}

		rtw_chplan_rtk_priv_req_prehdl_country_ent(param);
	}

	rtw_warn_on(!param->has_country);

	if (param->inr == RTW_REGD_SET_BY_USER) {
		rfctl->user_alpha2[0] = param->country_ent.alpha2[0];
		rfctl->user_alpha2[1] = param->country_ent.alpha2[1];
		rfctl->user_ChannelPlan = param->channel_plan;
#if CONFIG_IEEE80211_BAND_6GHZ
		rfctl->user_chplan_6g = param->channel_plan_6g;
#endif
	}

	if (!effected) {
		goto exit;
	}

	rfctl->regd_src = param->regd_src;
	rfctl->regd_inr = param->inr;
	rfctl->alpha2[0] = param->country_ent.alpha2[0];
	rfctl->alpha2[1] = param->country_ent.alpha2[1];
	rfctl->edcca_mode_2g_override = param->country_ent.edcca_mode_2g_override;
#if CONFIG_IEEE80211_BAND_5GHZ
	rfctl->edcca_mode_5g_override = param->country_ent.edcca_mode_5g_override;
#endif
#if CONFIG_IEEE80211_BAND_6GHZ
	rfctl->edcca_mode_6g_override = param->country_ent.edcca_mode_6g_override;
#endif
#if CONFIG_TXPWR_LIMIT
	rfctl->txpwr_lmt_override = param->country_ent.txpwr_lmt_override;
#endif
#if defined(CONFIG_80211AX_HE) || defined(CONFIG_80211AC_VHT)
	rfctl->proto_en = param->country_ent.proto_en;
#endif

	rfctl->ChannelPlan = param->channel_plan;
#if CONFIG_IEEE80211_BAND_6GHZ
	rfctl->chplan_6g = param->channel_plan_6g;
#endif

#if CONFIG_TXPWR_LIMIT
	rtw_txpwr_init_regd(rfctl);
#endif

	rtw_edcca_mode_update(rfctl_to_dvobj(rfctl));
	rtw_odm_adaptivity_update(rfctl_to_dvobj(rfctl));

